In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
np.random.seed(101)

In [38]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Boolean variables

In [5]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [7]:
booldf = df>0

In [9]:
df[booldf]   #returns the values where it is True, returns NaN where the values are False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [17]:
df[df['W']>0]     #returns the values which are greater than 0 in the 'W' column along with its rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
resdf = df[df['W']>0]

In [19]:
resdf['W']          # returns only the W column

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
df[df['W']>0]['W']   # same thing as above ,but in single command

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
df[df['W']>0][['W','Y']] #return multiple columns

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
D  0.188695 -0.933237
E  0.190794  2.605967

## Multiple boolean commands in DataFrames

In [26]:
df[(df['W']>0) & (df['Y']>1)]           # we use & operator here instead of 'and' ,because 'and' is ambiguous

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df.reset_index()        #use inplace=True to permanently reset the index to the below

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [40]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [57]:
newind = 'KA AP TN KL MA'.split()
df['States']=newind                     # to add new column in DataFrame
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     KA
B  0.681209  1.035125 -0.031160  1.939932     AP
C -1.005187 -0.741790  0.187125 -0.732845     TN
D -1.382920  1.482495  0.961458 -2.141212     KL
E  0.992573  1.192241 -1.046780  1.292765     MA